Revit 2026 API
FailuresAccessor.IsElementsDeletionPermitted Method
Overload List
Name | Description
IsElementsDeletionPermitted() |  Checks if resolution of the failures by deleting failure elements is permitted.
IsElementsDeletionPermitted(IList<ElementId>)
IsElementsDeletionPermitted(IList<ElementId>, String)
Top
See Also
Reference
FailuresAccessor Class
Autodesk.Revit.DB Namespace